snlkuharlocal/src/Documents/ПутевойЛист/ПутевойЛист.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПутевойЛист</name>
  <basedOn>Document.ПутевойЛист</basedOn>
  <registerRecords>InformationRegister.ПоказанияСпидометра</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиГСМ</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </attributes>
  <attributes>
    <name>КонечныйСпидометр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОстатокТопливаВозврат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расход</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Рейсов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Механик</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Диспетчер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Медик</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказчикПредставитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик1Представитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыездИзГаража</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВозвращениеВГараж</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Прицеп</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </attributes>
  <attributes>
    <name>Прицеп1</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПутевого</name>
    <type>
      <types>EnumRef.ТипПутевогоЛиста</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРаботы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидРаботы1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик1</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик2</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик3</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик4</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПрибытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПрибытия1</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПрибытия2</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПрибытия3</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПрибытия4</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПробегЗаПутевку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОстатокТопливаВыезд</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачальныйСпидометр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаправкаНаМаршруте</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпидометрСкорректированВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыездИзГаражаФактический</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВозвращениеВГаражФактическое</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДеньВыездаФакт</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДеньВозвращениеФакт</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоВтораяХодка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗаданиеВодителю</name>
    <attributes>
      <name>Заказчик</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяПрибытия</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресПунктаПогрузки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресПунктаРазгрузки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Груз</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЕздок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Расстояние</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПеревезтиТонн</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗаданиеВодителюАвтобусНеОбщегоПользования</name>
    <attributes>
      <name>Откуда</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Куда</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Расстояние</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/AccumulationRegisters/ОстаткиГСМ/ОстаткиГСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиГСМ</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/Enums/ТипПутевогоЛиста/ТипПутевогоЛиста.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипПутевогоЛиста</name>
  <enumValues>
    <name>ЛегковойАвтомобиль</name>
  </enumValues>
  <enumValues>
    <name>ГрузовойАвтомобильФорма4_С</name>
  </enumValues>
  <enumValues>
    <name>ГрузовойАвтомобильФорма4_П</name>
  </enumValues>
  <enumValues>
    <name>АвтобусНеОбщегоПользования</name>
  </enumValues>
  <enumValues>
    <name>СпециальныйАвтомобиль</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ПутевойЛист/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ЗаполнитьНачальныеДанные()
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	
	Если НЕ Объект.ЭтоВтораяХодка Тогда
		Объект.Дата=НачалоДня(Объект.Дата)+7*60*60;
	КонецЕсли;	 
	
	
	
	// Получаем показания спидометра
	Если НЕ Объект.СпидометрСкорректированВручную тогда
		Объект.НачальныйСпидометр  = Документы.ПутевойЛист.ПоказанияНачальногоСпидометра(Объект.Автомобиль, Объект.Дата);
	КонецЕсли;
	
	// Получаем остаток топлива перед выездом            
	Объект.ОстатокТопливаВыезд	= ПоказанияНачальныхОстатков(Объект.Автомобиль, Объект.Дата);
	
	Объект.Водитель				= Объект.Автомобиль.Водитель;
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьНормыРасхода()
	ДокОбъект			= РеквизитФормыВЗначение("Объект");
	
	РасходНаКМ 			= ДокОбъект.ПолучитьРасходНа100км();	 
	РасходНа1Операцию	= ДокОбъект.ПолучитьРасходНаОперацию();
КонецПроцедуры 

&НаКлиенте
Процедура Дата_ПриИзменении(Элемент)
	ЗаполнитьНачальныеДанные();
	Если Объект.ДеньВыездаФакт<Объект.Дата ИЛИ Объект.ДеньВозвращениеФакт<Объект.Дата Тогда
		Объект.ДеньВыездаФакт		=Объект.Дата;
		Объект.ДеньВозвращениеФакт	=Объект.Дата;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура АвтомобильПриИзменении(Элемент)
	ЗаполнитьНачальныеДанные();	
КонецПроцедуры 

&НаКлиенте
Процедура КонечныйСпидометрПриИзменении(Элемент)
	РассчитатьПробегиИРасход();	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьПробегиИРасход()
	Объект.ПробегЗаПутевку			= Объект.КонечныйСпидометр - Объект.НачальныйСпидометр;	 
	Объект.Расход 					= Объект.ПробегЗаПутевку * РасходНаКМ/100 + Объект.Рейсов*РасходНа1Операцию;
	Объект.ОстатокТопливаВозврат 	= Объект.ОстатокТопливаВыезд-Объект.Расход+Объект.ЗаправкаНаМаршруте;
КонецПроцедуры
 

&НаКлиенте
Процедура РейсовПриИзменении(Элемент)
	РассчитатьПробегиИРасход();
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьОстатокВБаке(Команда)	 
	Объект.ОстатокТопливаВыезд = ПоказанияНачальныхОстатков(Объект.Автомобиль, Объект.Дата);	 
КонецПроцедуры

&НаКлиенте
Процедура ВодительПриИзменении(Элемент)	 
	Объект.ВыездИзГаража		= ПрочитатьРежимРаботыВодителей(Объект.Водитель,Объект.Автомобиль, Объект.Дата);
	Объект.ВозвращениеВГараж 	= ПрочитатьРежимРаботыВодителей1(Объект.Водитель,Объект.Автомобиль, Объект.Дата);
КонецПроцедуры


&НаКлиенте
Процедура ТипПутевогоПриИзменении(Элемент)
	УстановитьВидимостьИДоступность(Истина);
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьИДоступность(ПриИзмененииТипаПутевого = Ложь)	 
	
	//////////////// Задание Водителю ///////////////////////////////////////////////////////////
	Элементы.ЗаданиеВодителю.Видимость = ? ((НЕ ЗначениеЗаполнено(Объект.ТипПутевого))
	ИЛИ Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.СпециальныйАвтомобиль
	ИЛИ Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.ЛегковойАвтомобиль
	ИЛИ Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.ГрузовойАвтомобильФорма4_П
	ИЛИ Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.АвтобусНеОбщегоПользования, Ложь, Истина);
	
	//////////////////ЗаданиеВодителюАвтобусаНеОбщегоПользования/////////////////////////////////
	Элементы.ЗаданиеВодителюАвтобусНеОбщегоПользования.Видимость = ? (( НЕ ЗначениеЗаполнено(Объект.ТипПутевого))
	ИЛИ Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.СпециальныйАвтомобиль
	ИЛИ Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.ЛегковойАвтомобиль
	ИЛИ Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.ГрузовойАвтомобильФорма4_П
	Или Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.ГрузовойАвтомобильФорма4_С, Ложь, Истина);
	
	///////////////// Рейсов ////////////////////////////////////////////////////////////////////
	Элементы.Рейсов.Видимость = ? ((НЕ ЗначениеЗаполнено(Объект.ТипПутевого))
	ИЛИ Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.ЛегковойАвтомобиль
	ИЛИ Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.АвтобусНеОбщегоПользования, Ложь, Истина);
	
	/////////////////// Элементы Прицеп и его номер//////////////////////////////////////////////
	Элементы.Прицеп.Видимость = ? ((НЕ ЗначениеЗаполнено(Объект.ТипПутевого))
	ИЛИ Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.ЛегковойАвтомобиль
	Или Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.АвтобусНеОбщегоПользования, Ложь, Истина);
	
	Элементы.ПрицепГосНомер.Видимость = ? ((НЕ ЗначениеЗаполнено(Объект.ТипПутевого))
	ИЛИ Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.ЛегковойАвтомобиль
	ИЛИ Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.АвтобусНеОбщегоПользования, Ложь, Истина);
	
	Элементы.Прицеп1.Видимость = ? ((НЕ ЗначениеЗаполнено(Объект.ТипПутевого))
	ИЛИ Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.ЛегковойАвтомобиль
	Или Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.АвтобусНеОбщегоПользования
	ИЛИ Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.СпециальныйАвтомобиль, Ложь, Истина);
	
	Элементы.Прицеп1ГосНомер.Видимость = ? ((НЕ ЗначениеЗаполнено(Объект.ТипПутевого))
	ИЛИ Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.ЛегковойАвтомобиль
	ИЛИ Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.АвтобусНеОбщегоПользования
	ИЛИ Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.СпециальныйАвтомобиль, Ложь, Истина);
	
	
	//////////////////// Элемент Заказчик и представитель и вид работ////////////////////////////
	Элементы.Заказчик.Видимость = ? (( НЕ ЗначениеЗаполнено(Объект.ТипПутевого))
	ИЛИ Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.ГрузовойАвтомобильФорма4_С, Ложь, Истина);
	
	Элементы.ЗаказчикПредставитель.Видимость = ? (( НЕ ЗначениеЗаполнено(Объект.ТипПутевого))
	ИЛИ Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.ГрузовойАвтомобильФорма4_С
	ИЛИ Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.АвтобусНеОбщегоПользования, Ложь, Истина);
	
	Элементы.ВидРаботы.Видимость = ? (( НЕ ЗначениеЗаполнено(Объект.ТипПутевого))
	ИЛИ Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.ГрузовойАвтомобильФорма4_С
	ИЛИ Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.АвтобусНеОбщегоПользования, Ложь, Истина);
	
	
	//////////////////// Элемент Заказчик 1 и представитель//////////////////////////////////////
	Элементы.Заказчик1.Видимость = ? ((НЕ ЗначениеЗаполнено(Объект.ТипПутевого))
	ИЛИ Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.ЛегковойАвтомобиль
	ИЛИ Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.ГрузовойАвтомобильФорма4_С, Ложь, Истина);
	
	Элементы.Заказчик1Представитель.Видимость = ?((НЕ ЗначениеЗаполнено(Объект.ТипПутевого))
	ИЛИ Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.ЛегковойАвтомобиль
	ИЛИ Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.ГрузовойАвтомобильФорма4_С
	ИЛИ Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.АвтобусНеОбщегоПользования, Ложь, Истина);
	
	Элементы.ВидРаботы.Видимость = ? ((НЕ ЗначениеЗаполнено(Объект.ТипПутевого))
	ИЛИ Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.ЛегковойАвтомобиль
	ИЛИ Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.ГрузовойАвтомобильФорма4_С
	ИЛИ Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.АвтобусНеОбщегоПользования, Ложь, Истина);
	
	Элементы.ВидРаботы1.Видимость = ? ((НЕ ЗначениеЗаполнено(Объект.ТипПутевого))
	ИЛИ Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.ЛегковойАвтомобиль
	ИЛИ Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.ГрузовойАвтомобильФорма4_С
	ИЛИ Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.АвтобусНеОбщегоПользования, Ложь, Истина);
	
	Элементы.Заказчик2.Видимость = ? ((НЕ ЗначениеЗаполнено(Объект.ТипПутевого))
	ИЛИ Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.ЛегковойАвтомобиль
	ИЛИ Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.СпециальныйАвтомобиль
	ИЛИ Объект.ТипПутевого =Перечисления.ТипПутевогоЛиста.ГрузовойАвтомобильФорма4_С
	ИЛИ Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.ГрузовойАвтомобильФорма4_П , Ложь, Истина);
	
	
	Элементы.Заказчик3.Видимость = ? ((НЕ ЗначениеЗаполнено(Объект.ТипПутевого))
	ИЛИ Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.ЛегковойАвтомобиль
	ИЛИ Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.СпециальныйАвтомобиль
	ИЛИ Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.ГрузовойАвтомобильФорма4_С
	ИЛИ Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.ГрузовойАвтомобильФорма4_П , Ложь, Истина);
	
	
	Элементы.Заказчик4.Видимость = ? ((НЕ ЗначениеЗаполнено(Объект.ТипПутевого))
	ИЛИ Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.ЛегковойАвтомобиль
	ИЛИ Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.СпециальныйАвтомобиль
	ИЛИ Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.ГрузовойАвтомобильФорма4_С	 
	ИЛИ Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.ГрузовойАвтомобильФорма4_П , Ложь, Истина);
	
	Элементы.ВремяПрибытия.Видимость = ? ((НЕ ЗначениеЗаполнено(Объект.ТипПутевого))
	ИЛИ Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.ЛегковойАвтомобиль
	ИЛИ Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.СпециальныйАвтомобиль
	ИЛИ Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.ГрузовойАвтомобильФорма4_С
	ИЛИ Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.ГрузовойАвтомобильФорма4_П , Ложь, Истина);
	
	Элементы.ВремяПрибытия1.Видимость = ? ((НЕ ЗначениеЗаполнено(Объект.ТипПутевого))
	ИЛИ Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.ЛегковойАвтомобиль
	ИЛИ Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.СпециальныйАвтомобиль
	ИЛИ Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.ГрузовойАвтомобильФорма4_С
	ИЛИ Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.ГрузовойАвтомобильФорма4_П , Ложь, Истина);
	
	
	Элементы.ВремяПрибытия2.Видимость = ? ((НЕ ЗначениеЗаполнено(Объект.ТипПутевого))
	ИЛИ Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.ЛегковойАвтомобиль
	ИЛИ Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.СпециальныйАвтомобиль
	ИЛИ Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.ГрузовойАвтомобильФорма4_С
	ИЛИ Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.ГрузовойАвтомобильФорма4_П , Ложь, Истина);
	
	
	Элементы.ВремяПрибытия3.Видимость = ? ((НЕ ЗначениеЗаполнено(Объект.ТипПутевого))
	ИЛИ Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.ЛегковойАвтомобиль
	ИЛИ Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.СпециальныйАвтомобиль
	ИЛИ Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.ГрузовойАвтомобильФорма4_С
	ИЛИ Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.ГрузовойАвтомобильФорма4_П , Ложь, Истина);
	
	
	Элементы.ВремяПрибытия4.Видимость = ? ((НЕ ЗначениеЗаполнено(Объект.ТипПутевого))
	ИЛИ Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.ЛегковойАвтомобиль
	ИЛИ Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.СпециальныйАвтомобиль
	ИЛИ Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.ГрузовойАвтомобильФорма4_С
	ИЛИ Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.ГрузовойАвтомобильФорма4_П , Ложь, Истина);	
	
//	Элементы.Печать_ПечатьНаПутевке.Видимость = (Объект.ТипПутевого = Перечисления.ТипПутевогоЛиста.СпециальныйАвтомобиль);	
	
	Если ПриИзмененииТипаПутевого Тогда
		Объект.Рейсов = 0;
	КонецЕсли;	 
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьВидимостьИДоступность(); 	 
	ЗаполнитьНормыРасхода();	
КонецПроцедуры


&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)	
	//кухарь 29.03.15 начало
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ТипПутевого=ПредопределенноеЗначение("Перечисление.ТипПутевогоЛиста.ГрузовойАвтомобильФорма4_С");
		ЗаполнитьНачальныеДанные();
		Объект.КонечныйСпидометр=Объект.НачальныйСпидометр;		
	КонецЕсли;
	//кухарь 29.03.15 конец	
	
	//Кухарь 23.06.15 начало
	ТекОстатокТопливаВозврат = Объект.ОстатокТопливаВыезд-Объект.Расход+Объект.ЗаправкаНаМаршруте;
	Если ТекОстатокТопливаВозврат<>Объект.ОстатокТопливаВозврат тогда
		Объект.ОстатокТопливаВозврат=ТекОстатокТопливаВозврат;
	КонецЕсли;
	//Кухарь 23.06.15 конец	
	
	УстановитьВидимостьИДоступность(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаправкуГСМ(Команда)
	Записать();	
	
	ОткрытьФормуМодально("Документ.ЗаправкаГСМ.ФормаОбъекта",Новый Структура("Основание",Объект.Ссылка),ЭтаФорма);	

	ЭтаФорма.Прочитать();	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСписаниеГСМ(Команда)
	Записать();
	
	ОткрытьФорму("Документ.СписаниеИзлишковГСМ.ФормаОбъекта",Новый Структура("Основание",Объект.Ссылка),ЭтаФорма);	
КонецПроцедуры

&НаКлиенте
Процедура ДетализацияРасходаГСМ(Команда)
	ТабДок=ДетализацияРасходаГСМНаСервере();
	ТабДок.показать();
КонецПроцедуры


&НаСервере
Функция ДетализацияРасходаГСМНаСервере()
	ТабДок		= Новый ТабличныйДокумент;
	
	ДокОбъект	= РеквизитФормыВЗначение("Объект");	
	Макет		= ДокОбъект.ПолучитьМакет("Детализация");  
	
	ОблШапка						= Макет.получитьобласть("Шапка");
	
	ОблШапка.Параметры.Автомобиль	= ДокОбъект.Автомобиль;
	ОблШапка.Параметры.Водитель		= ДокОбъект.Автомобиль.Водитель;
	
	ТабДок.Вывести(ОблШапка);
	
	Запрос=новый Запрос;
	Запрос.Текст= "
	|ВЫБРАТЬ
	|	Период,
	|	Регистратор,
	|	Автомобиль,
	|
	|	КоличествоНачальныйОстаток,	
	|	КоличествоПриход,
	|	КоличествоРасход,
	|	КоличествоКонечныйОстаток
	|ИЗ
	|	РегистрНакопления.ОстаткиГСМ.ОстаткиИОбороты(&Дата1,&Дата2,Регистратор,,Автомобиль = &Автомобиль)	
	|УПОРЯДОЧИТЬ ПО
	|	Период" ;
	
	Запрос.УстановитьПараметр("Дата1",		НачалоДня(ТекущаяДата()-3*30*24*60*60));
	Запрос.УстановитьПараметр("Дата2",		КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Автомобиль",	Объект.Автомобиль);
	
	Выборка=Запрос.Выполнить().выбрать();
	
	Пока Выборка.Следующий() цикл
		ОблСтрока	= Макет.ПолучитьОбласть("Строка");
		ОблСтрока.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(ОблСтрока);		
	КонецЦикла;
	
	Возврат ТабДок;
КонецФункции


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	если Объект.Номер="" тогда
		Объект.Номер="12345";
	КонецЕсли;
	если  Объект.ДеньВыездаФакт>Объект.ДеньВозвращениеФакт или ((объект.ВыездИзГаражаФактический>Объект.ВозвращениеВГаражФактическое) и  Объект.ДеньВыездаФакт=Объект.ДеньВозвращениеФакт)  тогда
		сообщить("Запрещено записывать документ с датой выезда более поздней, чем дата возвращения!");
		отказ=истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПерерасчитатьОстатки(Команда)
	ЗаполнитьНачальныеДанные();
	РассчитатьПробегиИРасход();
КонецПроцедуры

&НаКлиенте
Процедура СпидометрСкорректированВручнуюПриИзменении(Элемент)
	Если Объект.СпидометрСкорректированВручную Тогда
		ЭтаФорма.Элементы.НачальныйСпидометр.Доступность=Истина;
	Иначе
		ЭтаФорма.Элементы.НачальныйСпидометр.Доступность=Ложь;
		
		Объект.ПробегЗаПутевку		 	= Объект.КонечныйСпидометр - Объект.НачальныйСпидометр;
		Объект.Расход 					= Объект.ПробегЗаПутевку * РасходНаКМ /100 + Объект.Рейсов*РасходНа1Операцию;
		Объект.ОстатокТопливаВозврат	= Объект.ОстатокТопливаВыезд-Объект.Расход+Объект.ЗаправкаНаМаршруте;		
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПоказанияНачальныхОстатков(Автомобиль,Дата)
	Возврат Документы.ПутевойЛист.ПоказанияНачальныхОстатков(Автомобиль,Дата);
КонецФункции // ()

&НаСервереБезКонтекста
Функция ПрочитатьРежимРаботыВодителей(Водитель,Автомобиль, Дата);
	Возврат Документы.ПутевойЛист.ПрочитатьРежимРаботыВодителей(Водитель,Автомобиль,Дата);
КонецФункции	

&НаСервереБезКонтекста
Функция ПрочитатьРежимРаботыВодителей1(Водитель,Автомобиль, Дата);
	Возврат Документы.ПутевойЛист.ПрочитатьРежимРаботыВодителей1(Водитель,Автомобиль,Дата);
КонецФункции

&НаКлиенте
Процедура ДеньВыездаФактПриИзменении(Элемент)
	Если НЕ ЗначениеЗаполнено(Объект.ДеньВозвращениеФакт) Тогда
		Объект.ДеньВозвращениеФакт=Объект.ДеньВыездаФакт;	
	КонецЕсли;
КонецПроцедуры
